print("=== โปรแกรมค;านวณพื้นที่อเนกประสงค์ ===")
print("1. รูปสี่เหลี่ยมมุมฉาก")
print("2. รูปสามเหลี่ยม")
เมนู = input("เลือกเมนูที่ต้องการ (1 หรือ 2): ")

if เมนู == "1":
    กว้าง = float(input("กรอกความกว้าง (เมตร): "))
    ยาว = float(input("กรอกความยาว (เมตร): "))
    พื้นที่ = กว้าง * ยาว
    print("พื้นที่สี่เหลี่ยมคือ:", พื้นที่, "ตารางเมตร")

elif เมนู == "2":
 ฐาน = float(input("กรอกความยาวฐาน (เมตร): "))
 สูง = float(input("กรอกความสูง (เมตร): "))
พื้นที่ = 0.5 * ฐาน * สูง
print("พื้นที่สามเหลี่ยมคือ:", พื้นที่, "ตารางเมตร")